armade/contiki_sam4s/platform/pd956/net/rf231.c
/*---------------------------------------------------------------------------*/
/* convenience macros */
//#define RF231_STATUS()                    RF231_arch_status()
#define RF231_COMMAND(c)                  trx_reg_write(RF231_REG_TRX_STATE, c)

/* each frame has a footer consisting of LQI, ED, RX_STATUS added by the radio */
#define FOOTER_LEN                        3   /* bytes */
#define MAX_PACKET_LEN                    127 /* bytes, excluding the length (first) byte */

/* when transmitting, time to allow previous transmission to end before drop */
#define PREV_TX_TIMEOUT                   (10 * RTIMER_SECOND/1000)
/*---------------------------------------------------------------------------*/
#define _DEBUG_                 0
#define DEBUG_PRINTDATA       0    /* print frames to/from the radio; requires DEBUG == 1 */
#if _DEBUG_
#define PRINTF(...)       printf(__VA_ARGS__)
#else
#define PRINTF(...)
#endif

uint8_t bat_state_index = 5;
uint8_t bat_states[5] = {
		0b11, 	// 1.85V
		0b111,	// 2.05V
		0b1111,	// 2.45V
		0b10011,// 2.775V
		0b10111 // 3.075V
};

#define BUSYWAIT_UNTIL(cond, max_time)                                  \
  do {                                                                  \
    static rtimer_clock_t t0;                                                  \
    t0 = RTIMER_NOW();                                                  \
    while(!(cond) && RTIMER_CLOCK_LT(RTIMER_NOW(), t0 + (max_time)));   \
  } while(0)
/*---------------------------------------------------------------------------*/
/**
 * \brief      Get radio channel
 * \return     The radio channel
 */
int
rf_get_channel(void)
{
	uint8_t channel;
  channel=trx_reg_read(RF231_REG_PHY_CC_CCA) & PHY_CC_CCA_CHANNEL;
  //printf("RF231 channel%d\n",channel);
  return (int)channel;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief      Set radio channel
 * \param ch   The radio channel
 * \retval -1  Fail: channel number out of bounds
 * \retval 0   Success
 */
int
rf_set_channel(uint8_t ch)
{
  uint8_t temp;
  PRINTF("RF231: setting channel %u\n", ch);
  if(ch > 26 || ch < 11) {
    return -1;
  }

  /* read-modify-write to conserve other settings */
  temp = trx_reg_read(RF231_REG_PHY_CC_CCA);
  temp &=~ PHY_CC_CCA_CHANNEL;
  temp |= ch;
  trx_reg_write(RF231_REG_PHY_CC_CCA, temp);
  return 0;
}

unsigned char rf_radio_Is_Busy(void)
{
    unsigned char state;

    state = RF231_status();
    return (state == STATE_BUSY_RX_AACK ||
            state == STATE_BUSY_TX_ARET ||
            state == STATE_BUSY_TX ||
            state == STATE_BUSY_RX ||
            state == STATE_BUSY_RX_AACK_NOCLK);
}
/*---------------------------------------------------------------------------*/
/**
 * \brief      Get transmission power
 * \return     The transmission power
 */
int
RF231_get_txp(void)
{
  PRINTF("RF231: get txp\n");
  return trx_reg_read(RF231_REG_PHY_TX_PWR_CONF) & PHY_TX_PWR_TXP;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief      Set transmission power
 * \param txp  The transmission power
 * \retval -1  Fail: transmission power out of bounds
 * \retval 0   Success
 */
int
RF231_set_txp(uint8_t txp)
{
  PRINTF("RF231: setting txp %u\n", txp);
  if(txp > TXP_17M) {
    /* undefined */
    return -1;
  }

  trx_reg_write(RF231_REG_PHY_TX_PWR_CONF, txp);
  return 0;
}

unsigned char radioSetCSMASeed(void)
{
	uint8_t seed[2];

	csprng_get(seed,2);

	trx_reg_write(RF231_REG_CSMA_SEED_0,seed[0]);
	trx_bit_write(RF231_REG_CSMA_SEED_1, 0x03, 0, seed[1]);

	return 0;
}
volatile uint16_t batvoltage;
/*---------------------------------------------------------------------------*/
/**
 * \brief      Init the radio
 * \return     Returns success/fail
 * \retval 0   Success
 */
int
RF231_init(void)
{
	PRINTF("RF231: init.\n");
	uint16_t EEPROM_PAN;
	uint8_t EEPROM_channel;

	// reset will put us into TRX_OFF state
	// reset the radio core
	PhyReset();
	trx_spi_init();
	// Clear IRQ status
	trx_reg_read(RF231_REG_IRQ_STATUS);

	trx_reg_write(RF231_REG_TRX_STATE, TRXCMD_TRX_OFF);
	BUSYWAIT_UNTIL(0, 1 * RTIMER_SECOND / 1000);

	batvoltage = RF231_bat_volt();
	if(batvoltage>3075)	{ bat_state_index = 5;}else
	if(batvoltage>2775)	{ bat_state_index = 4;}else
	if(batvoltage>2450)	{ bat_state_index = 3;}else
	if(batvoltage>2050)	{ bat_state_index = 2;}else
	if(batvoltage>1850)	{ bat_state_index = 1;}else
	 					{ bat_state_index = 0;}

	trx_reg_write(RF231_REG_BATMON, bat_states[bat_state_index]);

	trx_irq_init((FUNC_PTR)RF231_interrupt_poll);
	ENABLE_TRX_IRQ();

	get_eeprom(channel,EEPROM_channel);

	/* Configure the radio using the default values except these. */
	trx_reg_write(RF231_REG_TRX_CTRL_0,		RF231_REG_TRX_CTRL_0_CONF); // No clock at pin 17 (CLKM), pin set to logic low
	trx_reg_write(RF231_REG_TRX_CTRL_1,		RF231_REG_TRX_CTRL_1_CONF); // TX auto crc on
	trx_reg_write(RF231_REG_TRX_CTRL_2,		RF231_REG_TRX_CTRL_2_CONF); // RX safe mode on, 250 kbps
	if(EEPROM_channel >= 11 && EEPROM_channel <=26)
		trx_reg_write(RF231_REG_PHY_CC_CCA,		EEPROM_channel); // Channel and CCA mode
	else
		trx_reg_write(RF231_REG_PHY_CC_CCA,		RF231_REG_PHY_CC_CCA_CONF); // Channel and CCA mode
	trx_reg_write(RF231_REG_PHY_TX_PWR, 	RF231_REG_PHY_TX_PWR_CONF); // TX power
	trx_reg_write(RF231_REG_IRQ_MASK,		RF231_REG_IRQ_MASK_CONF);
	// Set ack times shorter
	//trx_bit_write(SR_AACK_ACK_TIME, 1);

	get_eeprom(PANID,EEPROM_PAN);
	if(EEPROM_PAN == 0xffff)
		SetPanId(IEEE802154_CONF_PANID);
	else
		SetPanId(EEPROM_PAN);

	rf_generate_random_seed();

#if HW_CSMA_FRAME_RETRIES
	trx_bit_write(SR_MAX_FRAME_RETRIES, 5);
	trx_bit_write(SR_MAX_CSMA_RETRIES, 4);
	radioSetCSMASeed();
#else  
	trx_bit_write(SR_MAX_FRAME_RETRIES, 0);
	trx_bit_write(SR_MAX_CSMA_RETRIES, 7);
#endif  


	/* start the radio process */
	process_start(&RF231_radio_process, NULL);
	return 0;
}

/*
 * \brief Generates a 16-bit random number used as initial seed for srand()
 *
 */
static void rf_generate_random_seed(void)
{
	uint32_t seed = 0;
	uint8_t cur_random_val = 0;
	uint8_t i;

