armade/contiki_sam4s/platform/pd956/net/rf231.c
/*---------------------------------------------------------------------------*/
/* switch the radio on */
int
on(void)
{
  /* Check whether radio is in sleep */
  if(sleep_on)
  {
     /* Wake the radio. It'll move to TRX_OFF state */
	
  	 wake_from_sleep();
  	BUSYWAIT_UNTIL(0, (1 * RTIMER_SECOND / 1000)+1);
	 //delay_ms(1);
	 //printf("\r\nWake from sleep %d",RF231_get_channel());
	 sleep_on = 0;
  }
  uint8_t state_now = RF231_status();
  if(state_now != STATE_PLL_ON && state_now != STATE_TRX_OFF 
#if NULLRDC_CONF_802154_AUTOACK_HW
  && state_now != STATE_TX_ARET_ON
#endif
  ) {
    /* fail, we need the radio transceiver to be in either of those states */
    return -1;
  }

  /* go to RX_ON state */
  ENERGEST_ON(ENERGEST_TYPE_LISTEN);
  #if NULLRDC_CONF_802154_AUTOACK_HW
  RF231_COMMAND(TRXCMD_RX_AACK_ON);
  #else
  RF231_COMMAND(TRXCMD_RX_ON);
  #endif
  radio_is_on = 1;
  return 0;
}
/*---------------------------------------------------------------------------*/
/* switch the radio off */
int
off(void)
{ 
	volatile int status = RF231_status();

	if(status == STATE_TRX_OFF)
		return 0;

	/* turn off the radio transceiver */
	ENERGEST_OFF(ENERGEST_TYPE_LISTEN);
	RF231_COMMAND(TRXCMD_FORCE_TRX_OFF);
	do
	{
		status = RF231_status();
	} while (status == STATE_TRANSITION);
	if(status == STATE_TRX_OFF){
		radio_is_on = 0;
		return 0;
	}
	else
		return -1;
}
/*---------------------------------------------------------------------------*/
/* Put the Radio in sleep mode */

int 
RF231_sleep(void)
{
	int status = -1;
	/* Check whether we're already sleeping */
	if (!sleep_on) {
		/* Turn off the Radio */
		status = RF231_off();
		/* Set the SLP_PIN to high */
		if(status == 0) {
			sleep_on = 1;
			goto_sleep();
		}
	}
	
	return status;
}
/*---------------------------------------------------------------------------*/
/* used for indicating that the interrupt wasn't able to read SPI and must be serviced */
static volatile int interrupt_callback_wants_poll = 0;
/* used as a blocking semaphore to indicate that we are currently servicing an interrupt */
static volatile int interrupt_callback_in_progress = 0;

/**
 * \brief      Radio RF231 process, infinitely awaits a poll, then checks radio
 *             state and handles received data.
 */
PROCESS_THREAD(RF231_radio_process, ev, data)
{
  int len;
  PROCESS_BEGIN();
  PRINTF("RF231: started.\n");

  while(1) {
    PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);
    PRINTF("RF231: polled.\n");

    if(interrupt_callback_wants_poll) {
      RF231_interrupt_poll();
    }

    packetbuf_clear();
    // packetbuf_set_attr(PACKETBUF_ATTR_TIMESTAMP, last_packet_timestamp);
    len = RF231_read(packetbuf_dataptr(), PACKETBUF_SIZE);
    if(len > 0) {
      packetbuf_set_datalen(len);
      NETSTACK_RDC.input();
    } else {
      PRINTF("RF231: error while reading: %d\n", len);
    }
  }
  PROCESS_END();
}


/*---------------------------------------------------------------------------*/
/**
 * \brief      RF231 radio process poll function, to be called from the
 *             interrupt handler to poll the radio process
 * \retval 0   success
 */
int
RF231_interrupt_poll(void)
{  
	volatile uint8_t irq_source;
	 /* handle IRQ source (for what IRQs are enabled, see RF231-config.h) */
	 irq_source = trx_reg_read(RF231_REG_IRQ_STATUS);
	 if(irq_source & IRQ_TRX_DONE) {
		 
		 if(flag_transmit==1)
		 {
			 flag_transmit=0;
			 interrupt_callback_in_progress = 0;
			 #if NULLRDC_CONF_802154_AUTOACK_HW
			//printf("Status %x",trx_reg_read(RF231_REG_TRX_STATE) & TRX_STATE_TRAC_STATUS);
			if(!(trx_reg_read(RF231_REG_TRX_STATE) & TRX_STATE_TRAC_STATUS))
			ack_status = 1;
			 RF231_COMMAND(TRXCMD_RX_AACK_ON);
			 #endif
			 return 0;
		 }
  
  if( interrupt_callback_in_progress) {
    /* we cannot read out info from radio now, return here later (through a poll) */
    interrupt_callback_wants_poll = 1;
    process_poll(&RF231_radio_process);
    PRINTF("RF231: irq but busy, returns later.\n");
    return 0;
  }

  interrupt_callback_wants_poll = 0;
  interrupt_callback_in_progress = 1;

 
    /* we have started receiving a frame, len can be read */
    pending_frame = 1;
	//delay_cycles_ms(1);
    process_poll(&RF231_radio_process);
  }

	 if(irq_source & IRQ_BAT_LOW) {
	     /* Battery low */
		 bat_state_index--;
		 if(bat_state_index)
			 trx_reg_write(RF231_REG_BATMON, bat_states[bat_state_index]);
		 else
			 trx_reg_write(RF231_REG_IRQ_MASK,RF231_REG_IRQ_MASK_NO_BAT_CONF);
	   }

#if 0
  /* Note, these are not currently in use but here for completeness. */
  if(irq_source & IRQ_TRX_DONE) {
    /* End of transmitted or received frame.  */
  }
  if(irq_source & IRQ_TRXBUF_ACCESS_VIOLATION) {
    /* 
     * Access violation on the shared TX/RX FIFO. Possible causes:
     *  - buffer underrun while transmitting, ie not enough data in FIFO to tx
     *  - reading too fast from FIFO during rx, ie not enough data received yet
     *  - haven't read last rxed frame when next rx starts, but first is possible
     *    to read out, with possible corruption - check FCS
     *  - writing frames larger than 127 B to FIFO (len byte)
     */
    PRINTF("RF231-arch: access violation.\n");
  }
  if(irq_source & IRQ_BAT_LOW) {
    /* Battery low */
  }
  if(irq_source & IRQ_RX_ADDRESS_MATCH) {
    /* receiving frame address match */
  }
  if(irq_source & IRQ_CCA_ED_DONE) {
    /* CCA/ED done */
  }
  if(irq_source & IRQ_PLL_UNLOCK) {
    /* PLL unlock */
  }
  if(irq_source & IRQ_PLL_LOCK) {
    /* PLL lock */
  }
#endif

  interrupt_callback_in_progress = 0;
  return 0;
}

#if !NULLRDC_CONF_802154_AUTOACK_HW
/*---------------------------------------------------------------------------*/
/* 
 * Hard, brute reset of radio core and re-init due to it being in unknown,
 * unexpected, or locked state from which we cannot recover in the usual places.
 * Does a full reset and re-init.
 */
static void
radiocore_hard_recovery(void)
{
  RF231_init();
}
#endif


void
goto_sleep(void)
{
	TRX_SLP_TR_HIGH();
}
void
wake_from_sleep(void)
{
	TRX_SLP_TR_LOW();
}

uint8_t RF231_status(void)
{
	return (trx_reg_read(RF231_REG_TRX_STATUS) & TRX_STATUS);
}
/*---------------------------------------------------------------------------*/
// Don't call from Pon and sleep mode
/*
 * This function uses the comparator inside the chip.
 * EKS: voltage is 3.3V
 * we start by asking if the voltage is above or below 2.45V
 * The voltage is above so we set BATMON_HR = 1 and BATMON_VTH=0b0111 (3.075V)
 * We then ask if the voltage is above or below 3.075V
 * The voltage is above so we set BATMON_HR = 1 and BATMON_VTH=0b1011 (3.375V)
 * We then ask if the voltage is above or below 3.375V
 * The voltage is now below so we keep the bit clear and setBATMON_HR = 1 and BATMON_VTH=0b1001 (3.225V)
 * We then ask if the voltage is above or below 3.225V
 * The voltage is above so we set BATMON_HR = 1 and BATMON_VTH=0b1010 (3.300V)
 *
 * The last bit is kept clear to floor the result and be pessimistic.
 */
uint16_t RF231_bat_volt(void)
{
	volatile uint8_t reg;
	uint8_t i;

	reg = 0xf; //BATMON_VTH = 2.45

	for (i = 4; i > 0 ; i--){
		trx_reg_write(RF231_REG_BATMON, reg);
		reg = trx_reg_read(RF231_REG_BATMON);
		if(reg & (1 << 5)) //The battery voltage is above the threshold
			reg ^= (3 << (i - 1)); // set the bit again and clear the next
		else//The battery voltage is below the threshold.
			reg &= ~(1 << (i - 1)); // clear the next
	}

	if(reg & (1 << 4)) //BATMON_HR = 1
		return (reg & 0xf) * 75 + 2550;
	else
		return (reg & 0xf) * 50 + 1700;
}

// More efficient then ask for exact voltage
uint8_t RF231_bat_status(void)
{
	return bat_state_index;
}
